# Cleaning of the Sunshine List

In [1]:
#import dependencies
import pandas as pd

In [2]:
#File to Load 1996 t0 2019 to be used as dummy data
sunshine_data_to_load = "SunShine.csv"

In [3]:
# 1. Create a DataFrame for the 201908-citibike-tripdata data. 
sunshine_data_df = pd.read_csv(sunshine_data_to_load)

#display the data table for preview
sunshine_data_df.head()

,Sector,Last Name,First Name,Salary Paid,Taxable Benefits,Employer,Job Title,Calendar Year
0,COLLEGES,Gillett,Robert,127332.0,3633.0,Algonquin College of Applied Arts and Technology,President,1996
1,COLLEGES,Hanson,Raymonde,102999.0,5557.0,Algonquin College of Applied Arts and Technology,"V.P., Academic",1996
2,COLLEGES,Killeen,Philip,183482.0,878.0,Algonquin College of Applied Arts and Technology,Past President,1996
3,COLLEGES,Mitchelson,Robert,106608.0,5586.0,Algonquin College of Applied Arts and Technology,"V.P., Finance & Administration",1996
4,COLLEGES,Crombie,Glenn,111655.0,3177.0,Cambrian College of Applied Arts & Technology,President,1996

In [4]:
#review data types
sunshine_data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470706 entries, 0 to 1470705
Data columns (total 8 columns):
 #   Column            Non-Null Count    Dtype
---  ------            --------------    -----
 0   Sector            1470706 non-null  object
 1   Last Name         1470706 non-null  object
 2   First Name        1470703 non-null  object
 3   Salary Paid       1470706 non-null  float64
 4   Taxable Benefits  1470706 non-null  float64
 5   Employer          1470706 non-null  object
 6   Job Title         1470706 non-null  object
 7   Calendar Year     1470706 non-null  int64
dtypes: float64(2), int64(1), object(5)
memory usage: 89.8+ MB

In [5]:
#find null values
for column in sunshine_data_df.columns:
    print(f"Column {column} has {sunshine_data_df[column].isnull().sum()}null values")

Column Sector has 0null values
Column Last Name has 0null values
Column First Name has 3null values
Column Salary Paid has 0null values
Column Taxable Benefits has 0null values
Column Employer has 0null values
Column Job Title has 0null values
Column Calendar Year has 0null values

In [6]:
# Drop all rows with missing information
sunshine_data_df = sunshine_data_df.dropna(how='any')

In [7]:
# check that there are no null values
for column in sunshine_data_df.columns:
    print(f"Column {column} has {sunshine_data_df[column].isnull().sum()}null values")

Column Sector has 0null values
Column Last Name has 0null values
Column First Name has 0null values
Column Salary Paid has 0null values
Column Taxable Benefits has 0null values
Column Employer has 0null values
Column Job Title has 0null values
Column Calendar Year has 0null values

In [ ]:
sunshine_data_df['First Name'].str.lower()

# Clean First Name Column

In [21]:
# Display an overview of the First Name column...view with all lower case
# Do a count on all first names
first_count=sunshine_data_df['First Name'].str.lower().value_counts()

In [28]:
# Creating a new DataFrame using both duration and count
first_name_table = pd.DataFrame({"first_name_counts": first_count})
first_name_table.head()

         first_name_counts
david                27551
john                 26541
michael              26074
robert               21602
paul                 16261

KeyError: 'None of [0] are in the columns'

In [ ]:
#Create new column called sector category.  Update columns based on sector matching

In [ ]:
#review unique sector to make categories to match NAICS
sunshine_data_df['Sector'].unique()

In [ ]:
#Perform first name cleansing activities

In [ ]:
#Create LastName_FirstName concatenation column
sunshine_data_df["Last_First_Name"]=sunshine_data_df["Last Name"]+"_"+sunshine_data_df["First Name"]
sunshine_data_df.head()

In [ ]:
#review job_title
job_titlee=sunshine_data_df['Job Title'].unique().tolist()
job_title

In [ ]:
# Create Empty Gender, Age, City Location columns ******how do you assign datatype????*****
# sunshine_data_df.insert(4,"Age", float, allow_duplicates=False)
# sunshine_data_df.insert(2,"Gender", str, allow_duplicates=False)
sunshine_data_df.head()
sunshine_data_df.dtypes

In [ ]:
sunshine_data_df.insert(2,"Gender", str, allow_duplicates=False)
sunshine_data_df.head()

In [ ]:
sunshine_data_df.insert(9,"City", str, allow_duplicates=False)
sunshine_data_df.head()

In [ ]:
#Verify no duplicate entries of LastName_FirstName + year + title + employer
#need to rewrite code

print(f'Duplicate entries: {sunshine_data_df().sum()}')

In [ ]:
#Format salary to iclude $  and ,

In [ ]:
#reorder and rename columns

In [ ]:
sunshine_data_df.to_csv("Clean_SunShine.csv")
sunshine_data_df.head()